#include <iostream> 
using namespace std;
/*
Даны два числа a и b. Найти их среднее арифметическое: (a + b)/2
*/
int main(){
  int a, b;
  cout << "Введите два числа: ";
  cin >> a >> b;
  cout << "Среднее арифметическое: " << (a+b)/2 << endl;
}
