#include <iostream>
//Дана сторона квадрата а. Найти его периметр P = 4 * a;

int main(){
  int a, P;
  std::cout << "Введите размер стороны квадрата а: " << std::endl;
  std::cin >> a;
  P = 4 * a;
  std::cout << "Периметр квадрата: " << P << std::endl;


}
